subin = ""
print(subin)
subin = "송수빈"
print(subin)
_SUBIN = "김수빈"
print(_SUBIN) # 건들지 말라는 무언의 압박.

# 뉘앙스를 파악하면 난이도가 급격하게 떨어짐.
# 변수(variable, var) = 얼마든지 변할 수 있는 값, 재할당 
# 상수(constant, const) = 불변(im + mutable)한 것, 변하면 안되는 것
# 코드는 변하지 않을 때가 아름답다. 어지간하면 코드를 안 뜯어 고치고 싶어함
# 변수가 많으면 마음이 불안해짐 -> 안전하다(변하지 않을수록) vs 안전하지 않다.

# 실습 -> 어휘, 느낌, 뉘앙스 (학습패턴)
# 코드->한글, 한글->코드 : 의사코드의 힘 코드와 한글이 가까워지는 것이 좋겠다. 말로 쓰고 코드로 변환, 코드를 보고 ★말로 변환★
# 코드는 명칭이 세분화되어 있다. 의사전달의 중요성, 정확한 단어가 필요.

# 기준점 - 자가측정용
# 1. 물리적으로 언어의 작성법(기호) - 변별 -> 일부 암기가 필요 -> '한 번 더 해볼 것' vs 안 해도 되는 것 
# -> 결국에는 모두 정복 -> 핵심이 몇 개 안 됨(내장함수 외우기에는 너무 많음) -> 기호표기법이 기준
# 2. 프로그래밍 - 특정 설계도면의 전체 그림 보기 -> ex) 객체 만들기
# -> '기초랑 구분해서' 기본 -> 상당히 어려움 -> **양껏 만들고 풍부하게 만드는 것**
# 3. 설계도면을 다양하게 만들 수 있는 '자원운용' 
# 자원 -> '나', 실력이 아무리 좋아도 안만들면 꽝
# 4. ★필사적으로 찾을 도메인(내가 하고 있는 것, 절대 기준으로는 못할지언정 내가 꾸준히 즐기는 것) -> 없으면, 남이 시키는 것만 하게 됨.
# -> 내 취향이 끼어들 틈이 없어짐. 직급 사회에서는 더 심함.
# 취업, 창업 -> 조바심나면 도메인을 버리는 선택을 하기도 함 -> 취향보다 먹고 사는 게 중요해서 but, 도메인 없으면 갈 곳도 없음.
# 좋아하는 포인트가 없어서 회의 참여를 못함.

# 도메인 + 코드 
# 1. 기호를 봤을 때 뭔지는 몰라도 당황하지 않으면 OK
# 2. 어떤 글을 봤을 때 맥락을 짚어서 해석하면 OK
# 3. 어떤 글 자체를 만들 수 있다면 OK
# 4. 순수하게 좋아하는 것을 선택 OK
# 개선점을 수립 -> 도전 -> 연습 -> 해결하는 기분

# 용어를 정돈 -> 대화
# 서사를 만들어야 함 -> 감흥

# 오늘 어떤 개념을 소개 들었어. 
# 나는 이런 부분에서 이것을 어떻게 사용할 지 감이 안왔어.
# 네가 내 조언자로써 이것에 대해 연습할만한 것들을 소개해줄래?
# 나는 연구, 훈련, 지식 세가지 파트로 구분해서 훈련하고 있어.