def add(a, b): # 함수를 선언
    result = a + b
    print(result)
# 만들 때는 힘든데, 쓸 때는 좋다.
# 값은 나중에 만들어서 사용하는 것
# 답은 모르지만, 어떤 결과가 나올 것.

add(1,2)

# 보기는 좋은데 최악
# def number_three_print(): # 함수를 선언
#     result = 1+2 
#     print(result)

# number_three_print() # 3을 프린트하는 기계
# 처음에 테스트용으로 만들 때는 좋음.
# 미리 값을 정해놓고 사용하는 방식
# 답을 미리 정해놓음.

# 정적 vs 동적 (미리 정해 놓았는가? 미리 정하지 않았는가?)
# static vs dynamic
# 동찬이는 정적으로 정해진 42.195km를 달려서 타임어택하는 경기를 '마라톤'이라고 정적으로 부르기로 했다.
# 내일 동찬이는 경기에 뛸 예정이다. 몇 시에 도착할 지는 동적으로 그 때 가봐야 안다.
# 경기 주최측은 1,2,3~10등까지 정적으로 순위를 매기는 서류를 만들어 놓았다. 그 칸에 동찬이가 들어갈지는 그 때 동적으로 결정할 것이다.

# 305호실에 있는 학생 중 (전제, 제한)